Model: "DISCRIMINATOR"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_10 (Conv2D)           (None, 14, 14, 64)        1664
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 14, 14, 64)        0
_________________________________________________________________
dropout_15 (Dropout)         (None, 14, 14, 64)        0
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 7, 7, 128)         73856
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (None, 7, 7, 128)         0
_________________________________________________________________
dropout_16 (Dropout)         (None, 7, 7, 128)         0
_________________________________________________________________
flatten_5 (Flatten)          (None, 6272)              0
_________________________________________________________________
dense_12 (Dense)             (None, 1024)              6423552
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 1024)              0
_________________________________________________________________
dropout_17 (Dropout)         (None, 1024)              0
_________________________________________________________________
dense_13 (Dense)             (None, 1)                 1025
=================================================================
Total params: 6,500,097
Trainable params: 6,500,097
Non-trainable params: 0
_________________________________________________________________
