Model: "GENERATOR"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_14 (Dense)             (None, 6272)              633472
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 6272)              0
_________________________________________________________________
batch_normalization_4 (Batch (None, 6272)              25088
_________________________________________________________________
reshape_2 (Reshape)          (None, 7, 7, 128)         0
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 14, 14, 64)        204864
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 14, 14, 64)        0
_________________________________________________________________
batch_normalization_5 (Batch (None, 14, 14, 64)        256
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 28, 28, 1)         1601
=================================================================
Total params: 865,281
Trainable params: 852,609
Non-trainable params: 12,672
_________________________________________________________________
